# FamilySizeTableErrorInfo Class

---
Error information generated from the CSV file import of a FamilySizeTable.
SystemObject Autodesk.Revit.DBFamilySizeTableErrorInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FamilySizeTableErrorInfo : IDisposable

    Public Class FamilySizeTableErrorInfo
    	Implements IDisposable

    public ref class FamilySizeTableErrorInfo : IDisposable

    type FamilySizeTableErrorInfo =
        class
            interface IDisposable
        end
The FamilySizeTableErrorInfo type exposes the following members.
| Name| Description
---|---|---
| FamilySizeTableErrorInfo|  Constructs a new FamilySizeTableErrorInfo with default settings.
Top
| Name| Description
---|---|---
| FamilySizeTableErrorType|  The error type.
| FilePath|  The path of the imported CSV file.
| InvalidColumnIndex|  The index of the invalid column.
| InvalidHeaderText|  The invalid header text.
| InvalidRowIndex|  The index of the invalid row.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the FamilySizeTableErrorInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace